Repository: kberriom/UniversitySystemFront
Catalog: lib/l10n/university_system_ui_*.arb
Languages: es

# loginEmailHint
source: Email
es: Correo electrónico

# loginPasswordHint
source: Password
es: Contraseña

# loginButton
source: Login
es: Ingresar

# loginError
source: Incorrect email or password
es: Correo o contraseña incorrecta

# loginEmailError
source: Invalid email
es: Correo inválido

# veryVerboseErrorTryAgain
source: Oops! Something went wrong. Please try again later
es: Algo salió mal. Por favor, inténtalo de nuevo más tarde

# verboseErrorTryAgain
source: Oops, something went wrong please try later
es: Por favor intenta esto mas tarde

# verboseError
source: Oops, something went wrong
es: Ups! Algo salió mal

# error
source: Something went wrong
es: Algo salió mal

# sessionExpired
source: Your session has expired
es: Tu sesión ha expirado

# sessionExpiredMessage
source: For safety reasons please log in again
es: Por tu seguridad, por favor inicia sesión nuevamente

# subjectItemName
source: Subject
es: Materia

# userItemName
source: User
es: Usuario

# studentItemName
source: Student
es: Estudiante

# teacherItemName
source: Teacher
es: Profesor

# curriculumsItemName
source: Curriculum
es: Currículo

# gradeItemName
source: Grade
es: Calificación

# userItemNamePlural
source: Users
es: Usuarios

# subjectItemNamePlural
source: Subjects
es: Materias

# curriculumsItemNamePlural
source: Curriculums
es: Currículos

# gradeItemNamePlural
source: Grades
es: Calificaciones

# navDestHome
source: Home
es: Inicio

# navDestUsers
source: Users
es: Usuarios

# navDestSubjects
source: Subjects
es: Materias

# navDestCurriculums
source: Curriculums
es: Currículos

# signOutPopupMenu
source: Sign out
es: Cerrar sesión

# upperCaseHomeTitleAndUserName
source: HELLO {userName}
es: HOLA {userName}

# lowerCaseHomeTitleAndUserName
source: Hello {userName}
es: Hola {userName}

# homeQuickAccess
source: Quick access
es: Acceso rápido

# adminQuickAccessAddStudent
source: Add Student
es: Añadir estudiante

# adminQuickAccessAddTeacher
source: Add teacher
es: Añadir profesor

# adminQuickAccessCalGrades
source: Calculate grades
es: Calcular notas

# userTypeNameStudent
source: {count, plural, =1{Student} other{Students}}
es: {count, plural, =1{Estudiante} other{Estudiantes}}

# userTypeNameTeacher
source: {count, plural, =1{Teacher} other{Teachers}}
es: {count, plural, =1{Profesor} other{Profesores}}

# adminUserListSearchBoxHint
source: Search Users
es: Buscar Usuarios

# adminSubjectSearchBoxHint
source: Search Subjects
es: Buscar Materias

# adminCurriculumSearchBoxHint
source: Search Curriculums
es: Buscar Currículos

# listFiltersTooltip
source: Filters
es: Filtros

# adminUserListFetchNoData
source: No registered users
es: No hay usuarios registrados

# adminSubjectListFetchNoData
source: No registered subjects
es: No hay materias registradas

# adminCurriculumListFetchNoData
source: No registered curriculums
es: No hay currículos registrados

# oneFilterActiveRuleError
source: One filter must remain active
es: Debe haber al menos un filtro activo

# adminSubjectListNoRoomAssigned
source: No asgmt
es: Sin asign

# adminAddSubjectTitle
source: ADD SUBJECT
es: AÑADIR MATERIA

# adminAddCurriculumTitle
source: ADD CURRICULUM
es: AÑADIR CURRICULO

# adminAddFormItemName
source: Name
es: Nombre

# adminAddFormItemLastName
source: Last Name
es: Apellidos

# adminAddFormItemGovId
source: Government Id
es: Documento de identidad

# adminAddFormItemEmail
source: Email
es: Correo Electrónico

# adminAddFormItemCellPhone
source: Cell Phone Number
es: Número de celular

# adminAddFormItemLandline
source: Landline Number
es: Número fijo

# adminAddFormItemPhoneValidator
source: Cell phone or Landline required
es: Número celular o fijo requerido

# adminAddFormItemBirthdate
source: Birthdate
es: Fecha de nacimiento

# adminAddFormItemUsername
source: Username
es: Nombre de Usuario (UUID)

# adminAddFormItemPassword
source: Password
es: Contraseña

# adminAddFormItemConfirmPassword
source: Confirm Password
es: Confirmar Contraseña

# adminAddFormItemConfirmPasswordValidator
source: Passwords must match
es: Las Contraseñas deben ser iguales

# adminAddFormItemDepartment
source: Department
es: Departamento Profesor

# adminAddFormItemEnrollmentDate
source: Enrollment Date
es: Fecha de registro

# adminAddFormItemNotRegistered
source: Not registered
es: Sin registrar

# adminAddSubjectFormItemIsRemote
source: Is Remote?
es: Es Remoto?

# adminAddSubjectFormItemIsOnSite
source: Is On Site?
es: Es Presencial?

# subjectItemIsRemote
source: Is remote
es: Es remoto

# subjectItemIsOnSite
source: Is on site
es: Es presencial

# formItemDescription
source: Description
es: Descripción

# adminAddFormItemStartDate
source: Start date
es: Fecha inicio

# adminAddFormItemEndDate
source: End date
es: Fecha fin

# adminAddSubjectFormItemRoomLoc
source: Room location
es: Salón

# adminAddSubjectFormItemCreditsValue
source: Credits value
es: Número créditos

# adminAddSubjectFormConfirmation
source: Create new Subject
es: Crear nueva materia

# adminAddCurriculumFormConfirmation
source: Create new Curriculum
es: Crear nuevo currículo

# updateSubjectButton
source: Update Subject
es: Actualizar Materia

# updateCurriculumButton
source: Update Curriculum
es: Actualizar Currículo

source: Could not create subject
es: No fue posible crear la materia

# couldNotUpdateSubject
source: Could not update subject, please try later
es: No se pudo actualizar la materia, inténtalo mas tarde

# couldNotUpdateCurriculum
source: Could not update curriculum, please try later
es: No se pudo actualizar el currículo, inténtalo mas tarde

source: Edit subject
es: Editar materia

source: Edit curriculum
es: Editar currículo

# deleteModalAction
source: Delete
es: Eliminar

# cancelModalAction
source: Cancel
es: Cancelar

# successfullyDeletedSubject
source: Subject deleted successfully
es: Materia eliminada exitosamente

# successfullyDeletedCurriculum
source: Curriculum deleted successfully
es: Currículo eliminado exitosamente

# modalDeleteWarningTitle
source: Permanently delete?
es: Eliminar permanentemente?

# modalDeleteWarningContent
source: This action cannot be undone
es: Esta acción no se puede reversar

# subjectNameAlreadyExist
source: Subject name already exists and must be unique!
es: Ya existe una materia registrada bajo el mismo nombre

# curriculumNameAlreadyExist
source: Curriculum name already exists and must be unique!
es: Ya existe un currículo registrado bajo el mismo nombre

# detailSeeMoreInfo
source: More info
es: Datos extra

# dateTooltip
source: Date
es: Fecha

# dateStartTooltip
source: Starts
es: Inicia

# dateEndTooltip
source: Ends
es: Termina

# usernameTooltip
source: Username
es: Usuario

# adminSubjectDetailQuickActAddTeacher
source: Add/Update Teacher
es: Añadir/Modificar Profesor

# adminSubjectDetailQuickActRemoveTeacher
source: Remove Teacher
es: Remover Profesor

# adminSubjectDetailQuickActAddStudent
source: Add Student
es: Añadir Estudiante

# adminSubjectDetailQuickActRemoveStudent
source: Remove Student
es: Remover Estudiante

# subjectNoTeacherAsgmt
source: No teacher assigned
es: Sin profesor asignado

# subjectNoStudentAsgmt
source: No students assigned
es: Sin estudiantes asignados

source: No more items
es: No hay más items

# selectTeacherForResult
source: Select Teacher
es: Elegir Profesor

# selectStudentForResult
source: Select Student
es: Elegir Estudiante

# userAlreadyInSubjectError
source: User is already in subject
es: Este Usuario ya está asignado a la materia

source: Teacher role
es: Rol Profesor

# userDeletedFromSubject
source: User successfully removed from Subject
es: Usuario removido exitosamente de la materia

# userDeleteGenericErrorFromSubject
source: Could not remove user from subject
es: No se pudo remover el Usuario de la materia

# adminCurriculumDetailQuickActAddSubject
source: Add Subject to Curriculum
es: Añadir materia a currículo

# curriculumDetailAddSubjectModalTitle
source: Select Subject
es: Elegir Materia a añadir

# curriculumDetailAddSubjectModalSuccess
source: Subject added successfully
es: Materia añadida exitosamente

# adminCurriculumDetailQuickActRemoveSubject
source: Remove Subject from Curriculum
es: Remover Materia del currículo

# curriculumDetailRemoveSubjectModalTitle
source: Select Subject for removal
es: Elegir Materia a remover

# curriculumDetailRemoveSubjectModalSuccess
source: Subject removed successfully from Curriculum
es: Materia removida exitosamente

# passwordFieldShowTooltip
source: Show password
es: Mostrar contraseña

# passwordFieldHideTooltip
source: Hide password
es: Ocultar contraseña

# dateFieldValidRequired
source: Valid date required
es: Fecha válida requerida

# errorDeleteSubjectConflict
source: Cannot delete subject if it has any existing registration
es: Eliminación no permitida, Materia no puede tener registros existentes

# carouselUserItemTeacherRole
source: Role
es: Rol

# adminStudentDeleteSuccess
source: Student deleted
es: Estudiante Eliminado

# adminTeacherDeleteSuccess
source: Teacher deleted
es: Profesor Eliminado

# errorDeleteStudentConflict
source: Student cannot be deleted if there are still active registrations
es: Eliminación no permitida, El Estudiante no puede tener registros existentes

# adminEditStudentPageTitle
source: Edit Student
es: Editar Estudiante

# adminEditTeacherPageTitle
source: Edit Teacher
es: Editar Profesor

# adminEditStudentFormSubmitButton
source: Update Student
es: Actualizar Estudiante

# adminEditTeacherFormSubmitButton
source: Update Teacher
es: Actualizar Profesor

# errorDeleteTeacherConflict
source: Cannot delete teacher if they still have assigned subjects
es: Eliminación no permitida, El Profesor no puede tener Materias asignadas

# adminTeacherDetailDepartmentTooltip
source: Department
es: Departamento Profesor

# adminAddStudentPageTitle
source: Add Student
es: Añadir Estudiante

# adminAddTeacherPageTitle
source: Add Teacher
es: Añadir Profesor

# adminAddUserPageTitle
source: Add User
es: Añadir Nuevo Usuario

# adminAddStudentFormSubmitButton
source: Add Student
es: Añadir Estudiante

# adminAddTeacherFormSubmitButton
source: Add Teacher
es: Añadir Profesor

# adminAddUserConflictGovId
source: Government ID is already registered, could not create User
es: Documento de identidad ya asociado a otro Usuario, no es posible crear Usuario

# adminAddUserConflictUsername
source: Username is already assigned to another user, could not create User
es: UUID ya asociado a otro Usuario, no es posible crear Usuario

# adminAddUserConflictEmail
source: Email is already associated to another user, could not create User
es: Correo electrónico ya asociado a otro Usuario, no es posible crear Usuario
